{
  "title": "Quy Trình Sáng Tạo Nội Dung Blog",
  "sections": [
    {
      "id": "I",
      "title": "Tư Duy Nền Tảng",
      "subsections": [
        {
          "title": "Phương pháp: Vượt qua Trạng thái \"Mắc kẹt\"",
          "content": [
            {
              "type": "paragraph",
              "text": "Đây là một trạng thái tâm lý bế tắc, thiếu định hướng có thể gặp phải sau khi đã hoàn thành các bước chuẩn bị ban đầu."
            },
            {
              "type": "list",
              "items": [
                "Chấp nhận: Đây là một cảm giác hoàn toàn bình thường.",
                "Hành động: Phương pháp để vượt qua không phải là suy nghĩ nhiều hơn, mà là hành động dứt khoát.",
                "Triết lý: \"Hãy phóng một mũi tên\" (throw a dart) - tức là chọn một hướng và bắt tay vào làm ngay cả khi chưa chắc chắn."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "II",
      "title": "Hai Loại Bài Viết TRỤ CỘT Thường Sử Dụng",
      "subsections": [
        {
          "title": "1. Bài viết “How To” (Hướng dẫn)",
          "content": [
            {
              "type": "quote",
              "text": "Mô tả cách thực hiện một quy trình và sử dụng hình ảnh, video hoặc âm thanh để làm phong phú thêm nội dung."
            }
          ]
        },
        {
          "title": "2. Bài viết dạng Listicle (Danh sách)",
          "content": [
            {
              "type": "quote",
              "text": "Tạo danh sách các sách, công cụ, tài nguyên hoặc bất kỳ điều gì mà khách hàng của bạn có thể thấy hữu ích trong lĩnh vực marketing."
            }
          ]
        },
        {
          "title": "5 Góc Tiếp Cận Cho Bài Viết Trụ Cột",
          "content": [
            {
              "type": "paragraph",
              "text": "Chọn một góc tiếp cận hấp dẫn để thu hút người đọc:"
            },
            {
              "type": "list",
              "items": [
                "Lợi ích (Benefit): Hướng trực tiếp đến lợi ích cá nhân của người đọc.",
                "Mới lạ (New): Tiết lộ điều gì đó mới mẻ hoặc chưa từng biết đến.",
                "Mối đe dọa (Threat): Nhấn mạnh vào việc tránh khỏi nỗi đau hoặc rủi ro (một biến thể của Lợi ích).",
                "Đứng Trên Vai Người Khổng Lồ (Piggyback): Tận dụng uy tín hoặc sự phổ biến của một cá nhân/tổ chức khác.",
                "Tò mò (Curiosity): Kích thích sự tò mò mà không cung cấp thông tin một cách trực tiếp."
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "IV",
      "title": "Phụ Lục",
      "subsections": [
        {
          "title": "1. 10 Điểm Kiểm Tra Bài Viết Blog",
          "content": [
            {
              "type": "audit-list",
              "items": [
                {
                  "point": "1. Tiêu đề",
                  "criteria": [
                    "Rõ ràng, thu hút, dùng từ mạnh.",
                    "Phản ánh đúng lời hứa nội dung, không quá đà."
                  ]
                },
                {
                  "point": "2. LEAD",
                  "criteria": [
                    "Dễ tiếp cận, gây tò mò, nêu rõ lợi ích khi đọc.",
                    "Tránh dài dòng hoặc cấu trúc rườm rà."
                  ]
                },
                {
                  "point": "3. Tiêu thụ (Khả năng đọc)",
                  "criteria": [
                    "Dễ đọc, bố cục hợp lý, chuyển ý mượt.",
                    "Hạn chế “cản trở tốc độ” như đoạn dài, định dạng sai."
                  ]
                },
                {
                  "point": "4. Mục tiêu (CTA)",
                  "criteria": [
                    "Có lời kêu gọi hành động rõ, phù hợp và hấp dẫn.",
                    "Đặt ở vị trí nổi bật trong bài."
                  ]
                },
                {
                  "point": "5. Media (Hình ảnh, video, âm thanh)",
                  "criteria": [
                    "Chất lượng cao, liên quan nội dung.",
                    "Không thừa, không thiếu, dùng đúng ngữ cảnh."
                  ]
                },
                {
"point": "6. Kết thúc",
                  "criteria": [
                    "Tóm tắt tốt, gợi mở hoặc dẫn người đọc sang hành động kế tiếp."
                  ]
                },
                {
                  "point": "7. Tối ưu tìm kiếm (SEO)",
                  "criteria": [
                    "URL, tiêu đề, mô tả, tag được tối ưu từ khóa.",
                    "Có liên kết nội bộ và cơ hội liên kết ngoài."
                  ]
                },
                {
                  "point": "8. Phân loại",
                  "criteria": [
                    "Đặt đúng danh mục và gắn tag phù hợp."
                  ]
                },
                {
                  "point": "9. Đầy đủ nội dung",
                  "criteria": [
                    "Truyền tải trọn vẹn lời hứa trong tiêu đề.",
                    "Có ví dụ, hình ảnh, dữ liệu hỗ trợ."
                  ]
                },
                {
                  "point": "10. Tính nhất quán",
                  "criteria": [
                    "Giọng điệu, thông điệp và phong cách đồng nhất với thương hiệu."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
